; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	spectrograph4 - mode
	spectrograph0 - mode
	infrared3 - mode
	spectrograph1 - mode
	thermograph2 - mode
	Star1 - direction
	Star2 - direction
	Star4 - direction
	GroundStation3 - direction
	GroundStation0 - direction
	Star5 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Star8 - direction
	Planet9 - direction
	Phenomenon10 - direction
)
(:init
	(supports instrument0 spectrograph4)
	(supports instrument0 spectrograph0)
	(supports instrument0 infrared3)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 infrared3)
	(supports instrument1 spectrograph4)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 Star4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star4)
	(supports instrument2 infrared3)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 Star4)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon6)
	(supports instrument3 spectrograph0)
	(supports instrument3 spectrograph1)
	(supports instrument3 spectrograph4)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 GroundStation3)
	(supports instrument4 infrared3)
	(calibration_target instrument4 GroundStation0)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star1)
)
(:goal (and
	(pointing satellite2 Phenomenon10)
	(have_image Star5 infrared3)
	(have_image Phenomenon6 spectrograph0)
	(have_image Planet7 spectrograph4)
	(have_image Star8 spectrograph0)
	(have_image Planet9 thermograph2)
	(have_image Phenomenon10 spectrograph4)
))

)

; plan
1. (turn_to satellite2 groundstation3 star1)
   deleted: (pointing satellite2 star1)
   added: (pointing satellite2 groundstation3)
   goals met: 0 of 7
2. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 0 of 7
3. (calibrate satellite2 instrument3 groundstation3)
   added: (calibrated instrument3)
   goals met: 0 of 7
4. (turn_to satellite2 planet9 groundstation3)
   deleted: (pointing satellite2 groundstation3)
   added: (pointing satellite2 planet9)
   goals met: 0 of 7
5. (take_image satellite2 planet9 instrument3 thermograph2)
   added: (have_image planet9 thermograph2)
   goals met: 1 of 7
6. (turn_to satellite2 phenomenon10 planet9)
   deleted: (pointing satellite2 planet9)
   added: (pointing satellite2 phenomenon10)
   goals met: 2 of 7
7. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 2 of 7
8. (calibrate satellite0 instrument1 star4)
   added: (calibrated instrument1)
   goals met: 2 of 7
9. (take_image satellite2 phenomenon10 instrument3 spectrograph4)
   added: (have_image phenomenon10 spectrograph4)
   goals met: 3 of 7
10. (turn_to satellite0 phenomenon6 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 phenomenon6)
   goals met: 3 of 7
11. (take_image satellite0 phenomenon6 instrument1 spectrograph0)
   added: (have_image phenomenon6 spectrograph0)
   goals met: 4 of 7
12. (turn_to satellite0 planet7 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 planet7)
   goals met: 4 of 7
13. (take_image satellite0 planet7 instrument1 spectrograph4)
   added: (have_image planet7 spectrograph4)
   goals met: 5 of 7
14. (turn_to satellite0 star5 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star5)
   goals met: 5 of 7
15. (take_image satellite0 star5 instrument1 infrared3)
   added: (have_image star5 infrared3)
   goals met: 6 of 7
16. (turn_to satellite0 star8 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star8)
   goals met: 6 of 7
17. (take_image satellite0 star8 instrument1 spectrograph0)
   added: (have_image star8 spectrograph0)
   goals met: 7 of 7
